import React from "react";
import { Helmet } from "react-helmet";

export const PersonalData = () => {
    return <div className="personal-data" style={{width: '1300px', margin: '0 auto', marginTop: '30px', color: 'var(--black-color)'}}>
        <Helmet>
            <title>Согласие на обработку персональных данных</title>
        </Helmet>
        <h1><strong>СОГЛАСИЕ</strong></h1>
        <h2><strong>пользователя сайта на обработку персональных данных</strong></h2>
        <p style={{textAlign: 'justify', marginTop: '20px'}}>Настоящим я, во исполнение требований Федерального закона от 27.07.2006 г. № 152-ФЗ «О
персональных данных» (с изменениями и дополнениями) свободно, своей волей и своем интересе,
а также подтверждая свою дееспособность, даю свое согласие веб-сервису "TeamWork", место нахождения: Россия, город Санкт-Петербург, (далее – Веб-сервис), адрес Веб-сервиса: https://www.TeamWork.ru на обработку
своих персональных данных со следующими условиям: <br /><br />
1. Данное Согласие дается на обработку персональных данных, как без использования
средств автоматизации, так и с их использованием. Согласие дается на обработку следующих
моих персональных данных: фамилия, имя; электронная почта; личная фотография; данные обо мне, которые станут известны в
ходе исполнения договоров (в случае заключения договора между мной и Веб-сервисом), а также
иная общедоступная информация обо мне. <br /><br />
2. Персональные данные не являются общедоступными. <br /><br />
3. Основанием для обработки персональных данных является статья 24 Конституции
Российской Федерации; статья 6 Федерального закона № 152-ФЗ «О персональных данных»;
настоящее Согласие посетителя сайта на обработку персональных данных. <br /><br />
5. В ходе обработки с персональными данными будут совершены следующие действия: сбор,
запись, систематизация, накопление, хранение, уточнение (обновление, изменение), извлечение,
использование, передача (распространение, предоставление, доступ), блокирование, удаление,
уничтожение. <br /><br />
6. Настоящим я уведомлен Веб-сервисом, что предполагаемыми пользователями персональных
данных являются работники и пользователи Веб-сервиса, а также лица, привлеченные Веб-сервисом на условиях
гражданско-правового договора. <br /><br />
7. Я ознакомлен (а), что: <br /><br />
<div style={{marginLeft: '20px'}}>
7.1. настоящее Согласие на обработку моих персональных данных является бессрочным и
может быть отозвано посредством направления мною в адрес Веб-Сервиса (г. Санкт-Петербург, Набережная реки Мойки, 61) письменного заявления. Датой отзыва
считается день, следующий за днем вручения Веб-сервису письменного заявления об отзыве
Согласия пользователя сайта на обработку персональных данных;<br /><br />
7.2. имею право на доступ к моим персональным данным, требовать уточнения (обновление,
изменение) моих персональных данных, а также удаления и уничтожения моих персональных
данных в случае их обработки Обществом, нарушающих мои законные права и интересы,
законодательство Российской Федерации.<br /><br />
7.3. в случае отзыва Согласия на обработку персональных данных Веб-сервис вправе
продолжить обработку персональных данных без моего согласия при наличии оснований,
указанных в пунктах 2.11 части 1 статьи 6, части 2 статьи 10 и части 2 статьи 11 Федерального
закона №152-ФЗ «О персональных данных» от 27.07.2006 г.<br /><br />
</div>
8. Я обязуюсь в случае изменения моих персональных данных, сведений обо мне
незамедлительно сообщить Веб-сервису, с предоставлением подтверждающих документов.<br /><br />
9. Настоящим Согласием я подтверждаю, что являюсь субъектом предоставляемых
персональных данных, а также подтверждаю достоверность предоставляемых данных.<br /><br />
10. Настоящее Согласие действует все время до момента прекращения обработки
персональных данных, согласно п. 7.1 Согласия.</p>
    </div>
}